nohup: ignoring input
Using TensorFlow backend.
2019-01-09 00:23:08,482 __main__     INFO     Train 1 CNNs
2019-01-09 00:23:08,482 __main__     INFO     Train the 0th CNN
2019-01-09 00:23:08,482 __main__     INFO     Parameters of the 0th CNN is: [[3, 36, 1], [5, 36, 1], [1, 64, 1], [3, 48, 2], [7, 24, 1], [1, 64, 1]]
2019-01-09 00:23:08.526723: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 AVX512F FMA
2019-01-09 00:23:09.664373: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1432] Found device 0 with properties: 
name: Tesla P100-PCIE-16GB major: 6 minor: 0 memoryClockRate(GHz): 1.3285
pciBusID: 0000:18:00.0
totalMemory: 15.90GiB freeMemory: 15.61GiB
2019-01-09 00:23:09.664420: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1511] Adding visible gpu devices: 0
2019-01-09 00:23:10.154345: I tensorflow/core/common_runtime/gpu/gpu_device.cc:982] Device interconnect StreamExecutor with strength 1 edge matrix:
2019-01-09 00:23:10.154405: I tensorflow/core/common_runtime/gpu/gpu_device.cc:988]      0 
2019-01-09 00:23:10.154415: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1001] 0:   N 
2019-01-09 00:23:10.154731: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1115] Created TensorFlow device (/job:localhost/replica:0/task:0/device:GPU:0 with 15129 MB memory) -> physical GPU (device: 0, name: Tesla P100-PCIE-16GB, pci bus id: 0000:18:00.0, compute capability: 6.0)
2019-01-09 00:23:11,276 __main__     INFO     Model Description
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 32, 36)        1008      
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 36)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 36)        144       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 36)        32436     
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 36)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 36)        144       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 64)        2368      
_________________________________________________________________
activation_3 (Activation)    (None, 32, 32, 64)        0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 32, 32, 64)        256       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 48)        27696     
_________________________________________________________________
activation_4 (Activation)    (None, 16, 16, 48)        0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 48)        192       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 24)        56472     
_________________________________________________________________
activation_5 (Activation)    (None, 16, 16, 24)        0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 16, 16, 24)        96        
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 16, 64)        1600      
_________________________________________________________________
activation_6 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 16384)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                163850    
=================================================================
Total params: 286,518
Trainable params: 285,974
Non-trainable params: 544
