nohup: ignoring input
Using TensorFlow backend.
2019-01-09 05:16:32,934 __main__     INFO     Train 1 CNNs
2019-01-09 05:16:32,935 __main__     INFO     Train the 0th CNN
2019-01-09 05:16:32,935 __main__     INFO     Parameters of the 0th CNN is: [[1, 24, 1], [7, 64, 1], [1, 64, 1], [5, 48, 2], [5, 48, 1], [7, 24, 1], [7, 64, 1], [5, 24, 2], [1, 48, 1], [5, 36, 1], [1, 48, 1], [7, 24, 2], [1, 64, 1], [7, 36, 1]]
2019-01-09 05:16:33.041998: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 AVX512F FMA
2019-01-09 05:16:34.084586: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1432] Found device 0 with properties: 
name: Tesla P100-PCIE-16GB major: 6 minor: 0 memoryClockRate(GHz): 1.3285
pciBusID: 0000:3b:00.0
totalMemory: 15.90GiB freeMemory: 15.61GiB
2019-01-09 05:16:34.084685: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1511] Adding visible gpu devices: 0
2019-01-09 05:16:34.490360: I tensorflow/core/common_runtime/gpu/gpu_device.cc:982] Device interconnect StreamExecutor with strength 1 edge matrix:
2019-01-09 05:16:34.490423: I tensorflow/core/common_runtime/gpu/gpu_device.cc:988]      0 
2019-01-09 05:16:34.490432: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1001] 0:   N 
2019-01-09 05:16:34.490881: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1115] Created TensorFlow device (/job:localhost/replica:0/task:0/device:GPU:0 with 15127 MB memory) -> physical GPU (device: 0, name: Tesla P100-PCIE-16GB, pci bus id: 0000:3b:00.0, compute capability: 6.0)
2019-01-09 05:16:36,151 __main__     INFO     Model Description
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 32, 24)        96        
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 24)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 24)        96        
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 64)        75328     
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 64)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 64)        256       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 64)        4160      
_________________________________________________________________
activation_3 (Activation)    (None, 32, 32, 64)        0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 32, 32, 64)        256       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 48)        76848     
_________________________________________________________________
activation_4 (Activation)    (None, 16, 16, 48)        0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 48)        192       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 48)        57648     
_________________________________________________________________
activation_5 (Activation)    (None, 16, 16, 48)        0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 16, 16, 48)        192       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 16, 24)        56472     
_________________________________________________________________
activation_6 (Activation)    (None, 16, 16, 24)        0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 16, 16, 24)        96        
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 16, 16, 64)        75328     
_________________________________________________________________
activation_7 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 8, 24)          38424     
_________________________________________________________________
activation_8 (Activation)    (None, 8, 8, 24)          0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 8, 8, 24)          96        
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 8, 48)          1200      
_________________________________________________________________
activation_9 (Activation)    (None, 8, 8, 48)          0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 8, 8, 48)          192       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 8, 8, 36)          43236     
_________________________________________________________________
activation_10 (Activation)   (None, 8, 8, 36)          0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 8, 8, 36)          144       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 8, 48)          1776      
_________________________________________________________________
activation_11 (Activation)   (None, 8, 8, 48)          0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 48)          192       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 4, 4, 24)          56472     
_________________________________________________________________
activation_12 (Activation)   (None, 4, 4, 24)          0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 4, 4, 24)          96        
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 4, 4, 64)          1600      
_________________________________________________________________
activation_13 (Activation)   (None, 4, 4, 64)          0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 4, 4, 64)          256       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 4, 4, 36)          112932    
_________________________________________________________________
activation_14 (Activation)   (None, 4, 4, 36)          0         
_________________________________________________________________
batch_normalization_14 (Batc (None, 4, 4, 36)          144       
_________________________________________________________________
flatten_1 (Flatten)          (None, 576)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                5770      
=================================================================
Total params: 609,754
Trainable params: 608,522
Non-trainable params: 1,232
